Revit 2027 API
ScheduleField.HasSchedulableField Property
 Identifies if this ScheduleField object has access to a SchedulableField. Calculated and combined parameter fields will not have the access.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSchedulableField { get; }
Public ReadOnly Property HasSchedulableField As Boolean
	Get
public:
property bool HasSchedulableField {
	bool get ();
}
member HasSchedulableField : bool with get
Property Value
Boolean
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace